[
  {
    "symbol": "AAPL",
    "price": 178.72,
    "beta": 1.286802,
    "volAvg": 58405568,
    "mktCap": 2794144143933,
    "lastDiv": 0.96,
    "range": "124.17-198.23",
    "changes": -0.13,
    "companyName": "Apple Inc.",
    "currency": "USD",
    "cik": "0000320193",
    "isin": "US0378331005",
    "cusip": "037833100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Consumer Electronics",
    "website": "https://www.apple.com",
    "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. It also sells various related services. In addition, the company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; AirPods Max, an over-ear wireless headphone; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, HomePod, and iPod touch. Further, it provides AppleCare support services; cloud services store services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. Additionally, the company offers various services, such as Apple Arcade, a game subscription service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was incorporated in 1977 and is headquartered in Cupertino, California.",
    "ceo": "Mr. Timothy D. Cook",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "164000",
    "phone": "408 996 1010",
    "address": "One Apple Park Way",
    "city": "Cupertino",
    "state": "CA",
    "zip": "95014",
    "dcfDiff": 4.15176,
    "dcf": 150.082,
    "image": "https://financialmodelingprep.com/image-stock/AAPL.png",
    "ipoDate": "1980-12-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "MSFT",
    "price": 402.09,
    "beta": 0.89,
    "volAvg": 24143132,
    "mktCap": 2987705619600,
    "lastDiv": 3,
    "range": "245.73-420.82",
    "changes": -0.56,
    "companyName": "Microsoft Corporation",
    "currency": "USD",
    "cik": "0000789019",
    "isin": "US5949181045",
    "cusip": "594918104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.microsoft.com",
    "description": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. The company operates in three segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. The Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, Microsoft Viva, and Skype for Business; Skype, Outlook.com, OneDrive, and LinkedIn; and Dynamics 365, a set of cloud-based and on-premises business solutions for organizations and enterprise divisions. The Intelligent Cloud segment licenses SQL, Windows Servers, Visual Studio, System Center, and related Client Access Licenses; GitHub that provides a collaboration platform and code hosting service for developers; Nuance provides healthcare and enterprise AI solutions; and Azure, a cloud platform. It also offers enterprise support, Microsoft consulting, and nuance professional services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification on Microsoft products. The More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; and Windows Internet of Things. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. Microsoft Corporation was founded in 1975 and is headquartered in Redmond, Washington.",
    "ceo": "Mr. Satya  Nadella",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "221000",
    "phone": "425 882 8080",
    "address": "One Microsoft Way",
    "city": "Redmond",
    "state": "WA",
    "zip": "98052-6399",
    "dcfDiff": 70.51774,
    "dcf": 331.57225950411055,
    "image": "https://financialmodelingprep.com/image-stock/MSFT.png",
    "ipoDate": "1986-03-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AMZN",
    "price": 173.51,
    "beta": 1.171,
    "volAvg": 47610638,
    "mktCap": 1802317774000,
    "lastDiv": 0,
    "range": "88.12-180.14",
    "changes": -0.61,
    "companyName": "Amazon.com, Inc.",
    "currency": "USD",
    "cik": "0001018724",
    "isin": "US0231351067",
    "cusip": "023135106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Retail",
    "website": "https://www.amazon.com",
    "description": "Amazon.com, Inc. engages in the retail sale of consumer products and subscriptions through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). Its products offered through its stores include merchandise and content purchased for resale; and products offered by third-party sellers The company also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Rings, Blink, eero, and Echo; and develops and produces media content. In addition, it offers programs that enable sellers to sell their products in its stores; and programs that allow authors, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, the company provides compute, storage, database, analytics, machine learning, and other services, as well as fulfillment, advertising, and digital content subscriptions. Additionally, it offers Amazon Prime, a membership program. The company serves consumers, sellers, developers, enterprises, content creators, and advertisers. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.",
    "ceo": "Mr. Andrew R. Jassy",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "1525000",
    "phone": "206 266 1000",
    "address": "410 Terry Avenue North",
    "city": "Seattle",
    "state": "WA",
    "zip": "98109-5210",
    "dcfDiff": 121.25751,
    "dcf": 52.25249321782058,
    "image": "https://financialmodelingprep.com/image-stock/AMZN.png",
    "ipoDate": "1997-05-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "GOOGL",
    "price": 131.4,
    "beta": 1.044,
    "volAvg": 30507320,
    "mktCap": 1639930732909,
    "lastDiv": 0,
    "range": "89.42-153.78",
    "changes": -1.27,
    "companyName": "Alphabet Inc.",
    "currency": "USD",
    "cik": "0001652044",
    "isin": "US02079K3059",
    "cusip": "02079K305",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://www.abc.xyz",
    "description": "Alphabet Inc. provides various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment offers products and services, including ads, Android, Chrome, hardware, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play store; and Fitbit wearable devices, Google Nest home products, Pixel phones, and other devices, as well as in the provision of YouTube non-advertising services. The Google Cloud segment offers infrastructure, platform, and other services; Google Workspace that include cloud-based collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells health technology and internet services. The company was founded in 1998 and is headquartered in Mountain View, California.",
    "ceo": "Mr. Sundar  Pichai",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "182502",
    "phone": "650 253 0000",
    "address": "1600 Amphitheatre Parkway",
    "city": "Mountain View",
    "state": "CA",
    "zip": "94043",
    "dcfDiff": -73.70895,
    "dcf": 205.10894805943153,
    "image": "https://financialmodelingprep.com/image-stock/GOOGL.png",
    "ipoDate": "2004-08-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "META",
    "price": 496.09,
    "beta": 1.208,
    "volAvg": 18838222,
    "mktCap": 1264734463867,
    "lastDiv": 2,
    "range": "174.82-504.42",
    "changes": 5.87,
    "companyName": "Meta Platforms, Inc.",
    "currency": "USD",
    "cik": "0001326801",
    "isin": "US30303M1027",
    "cusip": "30303M102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Internet Content & Information",
    "website": "https://investor.fb.com",
    "description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. Meta Platforms, Inc. was incorporated in 2004 and is headquartered in Menlo Park, California.",
    "ceo": "Mr. Mark Elliot Zuckerberg",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "67317",
    "phone": "650 543 4800",
    "address": "1601 Willow Road",
    "city": "Menlo Park",
    "state": "CA",
    "zip": "94025",
    "dcfDiff": 17.36915,
    "dcf": 478.72084625550326,
    "image": "https://financialmodelingprep.com/image-stock/META.png",
    "ipoDate": "2012-05-18",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "TSLA",
    "price": 176.54,
    "beta": 2.415,
    "volAvg": 108433266,
    "mktCap": 562242826600,
    "lastDiv": 0,
    "range": "152.37-299.29",
    "changes": -4.2,
    "companyName": "Tesla, Inc.",
    "currency": "USD",
    "cik": "0001318605",
    "isin": "US88160R1014",
    "cusip": "88160R101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Auto Manufacturers",
    "website": "https://www.tesla.com",
    "description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. It operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.",
    "ceo": "Mr. Elon R. Musk",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "140473",
    "phone": "512 516 8177",
    "address": "1 Tesla Road",
    "city": "Austin",
    "state": "TX",
    "zip": "78725",
    "dcfDiff": 110.58315,
    "dcf": 65.95685208003417,
    "image": "https://financialmodelingprep.com/image-stock/TSLA.png",
    "ipoDate": "2010-06-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "NVDA",
    "price": 887,
    "beta": 1.725,
    "volAvg": 47275611,
    "mktCap": 2217500000000,
    "lastDiv": 0.16,
    "range": "222.97-897.24",
    "changes": 27.36,
    "companyName": "NVIDIA Corporation",
    "currency": "USD",
    "cik": "0001045810",
    "isin": "US67066G1040",
    "cusip": "67066G104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.nvidia.com",
    "description": "NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, and internationally. The company's Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building 3D designs and virtual worlds. Its Compute & Networking segment provides Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; cryptocurrency mining processors; Jetson for robotics and other embedded platforms; and NVIDIA AI Enterprise and other software. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, independent software vendors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. It has a strategic collaboration with Kroger Co. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.",
    "ceo": "Mr. Jen-Hsun  Huang",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "29600",
    "phone": "408 486 2000",
    "address": "2788 San Tomas Expressway",
    "city": "Santa Clara",
    "state": "CA",
    "zip": "95051",
    "dcfDiff": 687.96916,
    "dcf": 199.03084326282791,
    "image": "https://financialmodelingprep.com/image-stock/NVDA.png",
    "ipoDate": "1999-01-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "JNJ",
    "price": 159.34,
    "beta": 0.531,
    "volAvg": 7216932,
    "mktCap": 383813411800,
    "lastDiv": 4.76,
    "range": "144.95-175.97",
    "changes": -0.63,
    "companyName": "Johnson & Johnson",
    "currency": "USD",
    "cik": "0000200406",
    "isin": "US4781601046",
    "cusip": "478160104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.jnj.com",
    "description": "Johnson & Johnson, together with its subsidiaries, researches and develops, manufactures, and sells various products in the healthcare field worldwide. The company's Consumer Health segment offers baby care products under the JOHNSON'S and AVEENO Baby brands; oral care products under the LISTERINE brand; skin health/beauty products under the AVEENO, CLEAN & CLEAR, DR. CI:LABO, NEUTROGENA, and OGX brands; TYLENOL acetaminophen products; SUDAFED cold, flu, and allergy products; BENADRYL and ZYRTEC allergy products; MOTRIN IB ibuprofen products; NICORETTE smoking cessation products; and PEPCID acid reflux products. It also offers STAYFREE and CAREFREE sanitary pads; o.b. tampons; adhesive bandages under the BAND-AID brand; and first aid products under the NEOSPORIN brand. It serves general public, retail outlets, and distributors. The company's Pharmaceutical segment offers products for rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; HIV/AIDS and COVID-19 infectious diseases; mood disorders, neurodegenerative disorders, and schizophrenia; prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; thrombosis, diabetes and macular degeneration; and pulmonary arterial hypertension. This segment serves retailers, wholesalers, distributors, hospitals, and healthcare professionals directly for prescription use. Its MedTech segment provides electrophysiology products to treat cardiovascular diseases; neurovascular care products to treat hemorrhagic and ischemic stroke; orthopaedics products in support of hips, knees, trauma, spine, sports, and other; advanced and general surgery solutions that focus on breast aesthetics, ear, nose, and throat procedures; and disposable contact lenses and ophthalmic products related to cataract and laser refractive surgery under the ACUVUE brand. This segment serves wholesalers, hospitals, and retailers. The company was founded in 1886 and is based in New Brunswick, New Jersey.",
    "ceo": "Mr. Joaquin  Duato",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "131900",
    "phone": "732 524 0400",
    "address": "One Johnson & Johnson Plaza",
    "city": "New Brunswick",
    "state": "NJ",
    "zip": "08933",
    "dcfDiff": 0.28606,
    "dcf": 159.05394123558008,
    "image": "https://financialmodelingprep.com/image-stock/JNJ.png",
    "ipoDate": "1943-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "JPM",
    "price": 189.53,
    "beta": 1.127,
    "volAvg": 9253757,
    "mktCap": 545916526100,
    "lastDiv": 4.2,
    "range": "123.11-190.07",
    "changes": 0.98,
    "companyName": "JPMorgan Chase & Co.",
    "currency": "USD",
    "cik": "0000019617",
    "isin": "US46625H1005",
    "cusip": "46625H100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.jpmorganchase.com",
    "description": "JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through four segments: Consumer & Community Banking (CCB), Corporate & Investment Bank (CIB), Commercial Banking (CB), and Asset & Wealth Management (AWM). The CCB segment offers s deposit, investment and lending products, payments, and services to consumers; lending, deposit, and cash management and payment solutions to small businesses; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit card, auto loan, and leasing services. The CIB segment provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt markets capital-raising services, as well as loan origination and syndication; payments and cross-border financing; and cash and derivative instruments, risk management solutions, prime brokerage, and research. This segment also offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. The CB segment provides financial solutions, including lending, payments, investment banking, and asset management to small business, large and midsized companies, local governments, and nonprofit clients; and commercial real estate banking services to investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. The AWM segment offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, trusts and estates, loans, mortgages, deposits, and investment management products. The company also provides ATM, online and mobile, and telephone banking services. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.",
    "ceo": "Mr. James  Dimon",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "309926",
    "phone": "212 270 6000",
    "address": "383 Madison Avenue",
    "city": "New York",
    "state": "NY",
    "zip": "10179",
    "dcfDiff": 4.05896,
    "dcf": 185.4710374430227,
    "image": "https://financialmodelingprep.com/image-stock/JPM.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "V",
    "price": 280.43,
    "beta": 0.962,
    "volAvg": 5543871,
    "mktCap": 563374661520,
    "lastDiv": 2.08,
    "range": "208.76-286.13",
    "changes": 1.05,
    "companyName": "Visa Inc.",
    "currency": "USD",
    "cik": "0001403161",
    "isin": "US92826C8394",
    "cusip": "92826C839",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Credit Services",
    "website": "https://usa.visa.com",
    "description": "Visa Inc. operates as a payments technology company worldwide. The company facilitates digital payments among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, platforms, and value-added services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. Visa Inc. has a strategic agreement with Ooredoo to provide an enhanced payment experience for Visa cardholders and Ooredoo customers in Qatar. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Ryan M. McInerney",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "28800",
    "phone": "650 432 3200",
    "address": "PO Box 8999",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94128-8999",
    "dcfDiff": 92.97186,
    "dcf": 187.45813978823256,
    "image": "https://financialmodelingprep.com/image-stock/V.png",
    "ipoDate": "2008-03-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "PG",
    "price": 159.57,
    "beta": 0.43,
    "volAvg": 7193754,
    "mktCap": 375471401400,
    "lastDiv": 3.76,
    "range": "136.1-161.74",
    "changes": 0.25,
    "companyName": "The Procter & Gamble Company",
    "currency": "USD",
    "cik": "0000080424",
    "isin": "US7427181091",
    "cusip": "742718109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Household & Personal Products",
    "website": "https://www.pginvestor.com",
    "description": "The Procter & Gamble Company provides branded consumer packaged goods worldwide. It operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, and SK-II brands. The Grooming segment provides shave care products and appliances under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, taped diapers, and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. The company sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
    "ceo": "Mr. Jon R. Moeller",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "107000",
    "phone": "513 983 1100",
    "address": "One Procter & Gamble Plaza",
    "city": "Cincinnati",
    "state": "OH",
    "zip": "45202",
    "dcfDiff": -64.27468,
    "dcf": 223.84468412524618,
    "image": "https://financialmodelingprep.com/image-stock/PG.png",
    "ipoDate": "1978-01-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "UNH",
    "price": 472.6,
    "beta": 0.546,
    "volAvg": 3955257,
    "mktCap": 435706008400,
    "lastDiv": 7.52,
    "range": "445.68-554.7",
    "changes": -0.55,
    "companyName": "UnitedHealth Group Incorporated",
    "currency": "USD",
    "cik": "0000731766",
    "isin": "US91324P1021",
    "cusip": "91324P102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Healthcare Plans",
    "website": "https://www.unitedhealthgroup.com",
    "description": "UnitedHealth Group Incorporated operates as a diversified health care company in the United States. It operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage and well-being services to individuals age 50 and older addressing their needs for preventive and acute health care services, as well as services dealing with chronic disease and other specialized issues for older individuals; Medicaid plans, children's health insurance and health care programs; health and dental benefits; and hospital and clinical services. The OptumHealth segment provides access to networks of care provider specialists, health management services, care delivery, consumer engagement, and financial services. This segment serves individuals directly through care delivery systems, employers, payers, and government entities. The OptumInsight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The OptumRx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and compounding pharmacy, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease/drug therapy management. UnitedHealth Group Incorporated was incorporated in 1977 and is based in Minnetonka, Minnesota.",
    "ceo": "Sir Andrew Philip Witty",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "440000",
    "phone": "952 936 1300",
    "address": "UnitedHealth Group Center",
    "city": "Minnetonka",
    "state": "MN",
    "zip": "55343",
    "dcfDiff": -505.5807,
    "dcf": 978.180696956294,
    "image": "https://financialmodelingprep.com/image-stock/UNH.png",
    "ipoDate": "1984-10-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "HD",
    "price": 377.44,
    "beta": 0.99,
    "volAvg": 3455479,
    "mktCap": 375651689280,
    "lastDiv": 9,
    "range": "274.26-385.1",
    "changes": 1.24,
    "companyName": "The Home Depot, Inc.",
    "currency": "USD",
    "cik": "0000354950",
    "isin": "US4370761029",
    "cusip": "437076102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Home Improvement Retail",
    "website": "https://www.homedepot.com",
    "description": "The Home Depot, Inc. operates as a home improvement retailer. It operates The Home Depot stores that sell various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products The company also offers installation services for flooring, cabinets and cabinet makeovers, countertops, furnaces and central air systems, and windows. In addition, it provides tool and equipment rental services. The company primarily serves homeowners; and professional renovators/remodelers, general contractors, maintenance professionals, handymen, property managers, building service contractors, and specialty tradesmen, such as electricians, plumbers, and painters. It also sells its products through websites, including homedepot.com; blinds.com, an online site for custom window coverings; and thecompanystore.com, an online site for textiles and décor products. As of December 31, 2021, the company operated 2,317 stores in the United States. The Home Depot, Inc. was incorporated in 1978 and is based in Atlanta, Georgia.",
    "ceo": "Mr. Edward P. Decker",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "465000",
    "phone": "770 433 8211",
    "address": "2455 Paces Ferry Road",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30339",
    "dcfDiff": 24.09768,
    "dcf": 353.3423165931425,
    "image": "https://financialmodelingprep.com/image-stock/HD.png",
    "ipoDate": "1981-09-22",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "PYPL",
    "price": 58.12,
    "beta": 1.444,
    "volAvg": 18839698,
    "mktCap": 62289528800,
    "lastDiv": 0,
    "range": "50.25-79.265",
    "changes": -0.15,
    "companyName": "PayPal Holdings, Inc.",
    "currency": "USD",
    "cik": "0001633917",
    "isin": "US70450Y1038",
    "cusip": "70450Y103",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Credit Services",
    "website": "https://www.paypal.com",
    "description": "PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company's payments platform allows consumers to send and receive payments in approximately 200 markets and in approximately 100 currencies, withdraw funds to their bank accounts in 56 currencies, and hold balances in their PayPal accounts in 25 currencies. PayPal Holdings, Inc. was founded in 1998 and is headquartered in San Jose, California.",
    "ceo": "Mr. James Alexander Chriss",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "27200",
    "phone": "408 967 1000",
    "address": "2211 North First Street",
    "city": "San Jose",
    "state": "CA",
    "zip": "95131",
    "dcfDiff": -48.98089,
    "dcf": 107.10089488316785,
    "image": "https://financialmodelingprep.com/image-stock/PYPL.png",
    "ipoDate": "2015-07-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "MA",
    "price": 471.6,
    "beta": 1.078,
    "volAvg": 2513642,
    "mktCap": 436570966800,
    "lastDiv": 2.64,
    "range": "340.21-479.14",
    "changes": 4.08,
    "companyName": "Mastercard Incorporated",
    "currency": "USD",
    "cik": "0001141391",
    "isin": "US57636Q1040",
    "cusip": "57636Q104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Credit Services",
    "website": "https://www.mastercard.com",
    "description": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. It facilitates the processing of payment transactions, including authorization, clearing, and settlement, as well as delivers other payment-related products and services. The company offers integrated products and value-added services for account holders, merchants, financial institutions, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; prepaid programs and management services; commercial credit and debit payment products and solutions; and payment products and solutions that allow its customers to access funds in deposit and other accounts. It also provides value-added products and services comprising cyber and intelligence solutions for parties to transact, as well as proprietary insights, drawing on principled use of consumer, and merchant data services. In addition, the company offers analytics, test and learn, consulting, managed services, loyalty, processing, and payment gateway solutions for e-commerce merchants. Further, it provides open banking and digital identity platforms services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.",
    "ceo": "Mr. Michael  Miebach",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "33400",
    "phone": "914 249 2000",
    "address": "2000 Purchase Street",
    "city": "Purchase",
    "state": "NY",
    "zip": "10577",
    "dcfDiff": 225.14659,
    "dcf": 246.4534143439891,
    "image": "https://financialmodelingprep.com/image-stock/MA.png",
    "ipoDate": "2006-05-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "WMT",
    "price": 60.57,
    "beta": 0.497,
    "volAvg": 23209547,
    "mktCap": 487757490300,
    "lastDiv": 0.83,
    "range": "45.363335-60.62",
    "changes": 0.53,
    "companyName": "Walmart Inc.",
    "currency": "USD",
    "cik": "0000104169",
    "isin": "US9311421039",
    "cusip": "931142103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Discount Stores",
    "website": "https://www.stock.walmart.com",
    "description": "Walmart Inc. engages in the operation of retail, wholesale, and other units worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores; membership-only warehouse clubs; ecommerce websites, such as walmart.com, walmart.com.mx, walmart.ca, flipkart.com, and samsclub.com; and mobile commerce applications. The company offers grocery and consumables, which includes dairy, meat, bakery, deli, produce, dry, chilled or frozen packaged foods, alcoholic and nonalcoholic beverages, floral, snack foods, candy, other grocery items, health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items; and health and wellness products covering pharmacy, over-the-counter drugs and other medical products, and optical and hearing services. It also provides gasoline stations and tobacco; home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses, and tire and battery centers; and consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. In addition, the company offers fuel and financial services and related products, including money orders, prepaid cards, money transfers, and check cashing and bill payment, as well as various types of installment lending. It operates approximately 10,500 stores and various e-commerce websites under 46 banners in 24 countries. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. The company was founded in 1945 and is based in Bentonville, Arkansas.",
    "ceo": "Mr. C. Douglas McMillon",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "2100000",
    "phone": "479 273 4000",
    "address": "702 South West 8th Street",
    "city": "Bentonville",
    "state": "AR",
    "zip": "72716",
    "dcfDiff": 14.25127,
    "dcf": 46.31873428530864,
    "image": "https://financialmodelingprep.com/image-stock/WMT.png",
    "ipoDate": "1972-08-25",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "ADBE",
    "price": 543.09,
    "beta": 1.294,
    "volAvg": 3302522,
    "mktCap": 245476680000,
    "lastDiv": 0,
    "range": "323.29-638.25",
    "changes": -1.75,
    "companyName": "Adobe Inc.",
    "currency": "USD",
    "cik": "0000796343",
    "isin": "US00724F1012",
    "cusip": "00724F101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Software—Infrastructure",
    "website": "https://www.adobe.com",
    "description": "Adobe Inc. operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, workers, marketers, educators, enthusiasts, communicators, and consumers. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through a network of distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.",
    "ceo": "Mr. Shantanu  Narayen",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "29945",
    "phone": "408 536 6000",
    "address": "345 Park Avenue",
    "city": "San Jose",
    "state": "CA",
    "zip": "95110-2704",
    "dcfDiff": 86.24235,
    "dcf": 456.84765477259845,
    "image": "https://financialmodelingprep.com/image-stock/ADBE.png",
    "ipoDate": "1986-08-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "BAC",
    "price": 35.42,
    "beta": 1.388,
    "volAvg": 41847538,
    "mktCap": 278849617200,
    "lastDiv": 0.96,
    "range": "24.96-35.79",
    "changes": 0.03,
    "companyName": "Bank of America Corporation",
    "currency": "USD",
    "cik": "0000070858",
    "isin": "US0605051046",
    "cusip": "060505104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Banks—Diversified",
    "website": "https://www.bankofamerica.com",
    "description": "Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. Its Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, noninterest-and interest-bearing checking accounts, and investment accounts and products; and credit and debit cards, residential mortgages, and home equity loans, as well as direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The company's Global Wealth & Investment Management segment offers investment management, brokerage, banking, and trust and retirement products and services; and wealth management solutions, as well as customized solutions, including specialty asset management services. Its Global Banking segment provides lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, and short-term investing options and merchant services; working capital management solutions; and debt and equity underwriting and distribution, and merger-related and other advisory services. The company's Global Markets segment offers market-making, financing, securities clearing, settlement, and custody services, as well as risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. As of December 31, 2021, it served approximately 67 million consumer and small business clients with approximately 4,200 retail financial centers; approximately 16,000 ATMs; and digital banking platforms with approximately 41 million active users. The company was founded in 1784 and is based in Charlotte, North Carolina.",
    "ceo": "Mr. Brian Thomas Moynihan",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "213000",
    "phone": "704 386 5681",
    "address": "Bank of America Corporate Center",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28255",
    "dcfDiff": 5.79305,
    "dcf": 29.62695124538499,
    "image": "https://financialmodelingprep.com/image-stock/BAC.png",
    "ipoDate": "1973-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "NFLX",
    "price": 597.69,
    "beta": 1.219,
    "volAvg": 4890269,
    "mktCap": 258656324400,
    "lastDiv": 0,
    "range": "285.33-624.42",
    "changes": -0.81,
    "companyName": "Netflix, Inc.",
    "currency": "USD",
    "cik": "0001065280",
    "isin": "US64110L1061",
    "cusip": "64110L106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Entertainment",
    "website": "https://www.netflix.com",
    "description": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and mobile games across various genres and languages. The company provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services in the United States. The company has approximately 222 million paid members in 190 countries. Netflix, Inc. was incorporated in 1997 and is headquartered in Los Gatos, California.",
    "ceo": "Mr. Theodore A. Sarandos",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "13000",
    "phone": "408 540 3700",
    "address": "100 Winchester Circle",
    "city": "Los Gatos",
    "state": "CA",
    "zip": "95032",
    "dcfDiff": 540.68603,
    "dcf": 57.00396557210248,
    "image": "https://financialmodelingprep.com/image-stock/NFLX.png",
    "ipoDate": "2002-05-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "CRM",
    "price": 303.77,
    "beta": 1.283,
    "volAvg": 5762749,
    "mktCap": 294049360000,
    "lastDiv": 1.6,
    "range": "170.0-318.71",
    "changes": 5.02,
    "companyName": "Salesforce, Inc.",
    "currency": "USD",
    "cik": "0001108524",
    "isin": "US79466L3024",
    "cusip": "79466L302",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Application",
    "website": "https://www.salesforce.com",
    "description": "Salesforce, Inc. provides customer relationship management technology that brings companies and customers together worldwide. Its Customer 360 platform empowers its customers to work together to deliver connected experiences for their customers. The company's service offerings include Sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and relationship intelligence, and deliver quotes, contracts, and invoices; and Service that enables companies to deliver trusted and highly personalized customer service and support at scale. Its service offerings also comprise flexible platform that enables companies of various sizes, locations, and industries to build business apps to bring them closer to their customers with drag-and-drop tools; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, a system of engagement. In addition, the company's service offerings include Marketing offering that enables companies to plan, personalize, and optimize one-to-one customer marketing journeys; and Commerce offering, which empowers brands to unify the customer experience across mobile, web, social, and store commerce points. Further, its service offerings comprise Tableau, an end-to-end analytics solution serving various enterprise use cases; and MuleSoft, an integration offering that allows its customers to unlock data across their enterprise. The company provides its service offering for customers in financial services, healthcare and life sciences, manufacturing, and other industries. It also offers professional services; and in-person and online courses to certify its customers and partners on architecting, administering, deploying, and developing its service offerings. The company provides its services through direct sales; and consulting firms, systems integrators, and other partners. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.",
    "ceo": "Mr. Marc R. Benioff",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "72682",
    "phone": "415 901 7000",
    "address": "Salesforce Tower",
    "city": "San Francisco",
    "state": "CA",
    "zip": "94105",
    "dcfDiff": 110.3789,
    "dcf": 189.39110127716035,
    "image": "https://financialmodelingprep.com/image-stock/CRM.png",
    "ipoDate": "2004-06-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "PFE",
    "price": 27.19,
    "beta": 0.557,
    "volAvg": 48473384,
    "mktCap": 153535948200,
    "lastDiv": 1.68,
    "range": "25.61-42.22",
    "changes": 1.11,
    "companyName": "Pfizer Inc.",
    "currency": "USD",
    "cik": "0000078003",
    "isin": "US7170811035",
    "cusip": "717081103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.pfizer.com",
    "description": "Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic and women's health under the Premarin family and Eliquis brands; biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Sutent, Inlyta, Retacrit, Lorbrena, and Braftovi brands; and sterile injectable and anti-infective medicines, and oral COVID-19 treatment under the Sulperazon, Medrol, Zavicefta, Zithromax, Vfend, Panzyga, and Paxlovid brands. The company also provides medicines and vaccines in various therapeutic areas, such as pneumococcal disease, meningococcal disease, tick-borne encephalitis, and COVID-19 under the Comirnaty/BNT162b2, Nimenrix, FSME/IMMUN-TicoVac, Trumenba, and the Prevnar family brands; biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Eucrisa/Staquis, and Cibinqo brands; and amyloidosis, hemophilia, and endocrine diseases under the Vyndaqel/Vyndamax, BeneFIX, and Genotropin brands. In addition, the company is involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, and individual provider offices, as well as disease control and prevention centers. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Myovant Sciences Ltd.; Akcea Therapeutics, Inc; Merck KGaA; Valneva SE; BioNTech SE; and Arvinas, Inc. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.",
    "ceo": "Dr. Albert  Bourla D.V.M., Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "88000",
    "phone": "212 733 2323",
    "address": "235 East 42nd Street",
    "city": "New York",
    "state": "NY",
    "zip": "10017",
    "dcfDiff": -42.44115,
    "dcf": 69.63114660633535,
    "image": "https://financialmodelingprep.com/image-stock/PFE.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "CMCSA",
    "price": 42.15,
    "beta": 0.98,
    "volAvg": 19725608,
    "mktCap": 167015581500,
    "lastDiv": 1.24,
    "range": "34.63-47.46",
    "changes": 0.09,
    "companyName": "Comcast Corporation",
    "currency": "USD",
    "cik": "0001166691",
    "isin": "US20030N1019",
    "cusip": "20030N101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Telecom Services",
    "website": "https://corporate.comcast.com",
    "description": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Media, Studios, Theme Parks, and Sky segments. The Cable Communications segment offers broadband, video, voice, wireless, and other services to residential and business customers under the Xfinity brand; and advertising services. The Media segment operates NBCUniversal's television and streaming platforms, including national, regional, and international cable networks, the NBC and Telemundo broadcast, and Peacock networks. The Studios segment operates NBCUniversal's film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The Sky segment offers direct-to-consumer services, such as video, broadband, voice and wireless phone services, and content business operates entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania; and provides streaming service, such as Peacock. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
    "ceo": "Mr. Brian L. Roberts",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "186000",
    "phone": "215 286 1700",
    "address": "One Comcast Center",
    "city": "Philadelphia",
    "state": "PA",
    "zip": "19103-2838",
    "dcfDiff": -34.64754,
    "dcf": 76.79754129078091,
    "image": "https://financialmodelingprep.com/image-stock/CMCSA.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "DIS",
    "price": 110.06,
    "beta": 1.412,
    "volAvg": 12638167,
    "mktCap": 201883058000,
    "lastDiv": 0.9,
    "range": "78.73-115.19",
    "changes": -2.81,
    "companyName": "The Walt Disney Company",
    "currency": "USD",
    "cik": "0001744489",
    "isin": "US2546871060",
    "cusip": "254687106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Entertainment",
    "website": "https://www.thewaltdisneycompany.com",
    "description": "The Walt Disney Company, together with its subsidiaries, operates as an entertainment company worldwide. It operates through two segments, Disney Media and Entertainment Distribution; and Disney Parks, Experiences and Products. The company engages in the film and episodic television content production and distribution activities, as well as operates television broadcast networks under the ABC, Disney, ESPN, Freeform, FX, Fox, National Geographic, and Star brands; and studios that produces motion pictures under the Walt Disney Pictures, Twentieth Century Studios, Marvel, Lucasfilm, Pixar, and Searchlight Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, ESPN+, Hulu, and Star+; sale/licensing of film and television content to third-party television and subscription video-on-demand services; theatrical, home entertainment, and music distribution services; staging and licensing of live entertainment events; and post-production services by Industrial Light & Magic and Skywalker Sound. In addition, the company operates theme parks and resorts, such as Walt Disney World Resort in Florida; Disneyland Resort in California; Disneyland Paris; Hong Kong Disneyland Resort; and Shanghai Disney Resort; Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney as well as Aulani, a Disney resort and spa in Hawaii; licenses its intellectual property to a third party for the operations of the Tokyo Disney Resort; and provides consumer products, which include licensing of trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games. Further, it sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The Walt Disney Company was founded in 1923 and is based in Burbank, California.",
    "ceo": "Mr. Robert A. Iger",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "173250",
    "phone": "818 560 1000",
    "address": "500 South Buena Vista Street",
    "city": "Burbank",
    "state": "CA",
    "zip": "91521",
    "dcfDiff": 94.6829,
    "dcf": 15.37709974128112,
    "image": "https://financialmodelingprep.com/image-stock/DIS.png",
    "ipoDate": "1957-11-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "ABBV",
    "price": 181.06,
    "beta": 0.555,
    "volAvg": 5373254,
    "mktCap": 319837058200,
    "lastDiv": 6.2,
    "range": "130.96-182.16",
    "changes": 1.9,
    "companyName": "AbbVie Inc.",
    "currency": "USD",
    "cik": "0001551152",
    "isin": "US00287Y1091",
    "cusip": "00287Y109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.abbvie.com",
    "description": "AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals in the worldwide. The company offers HUMIRA, a therapy administered as an injection for autoimmune and intestinal Behçet's diseases; SKYRIZI to treat moderate to severe plaque psoriasis in adults; RINVOQ, a JAK inhibitor for the treatment of moderate to severe active rheumatoid arthritis in adult patients; IMBRUVICA to treat adult patients with chronic lymphocytic leukemia (CLL), small lymphocytic lymphoma (SLL), and VENCLEXTA, a BCL-2 inhibitor used to treat adults with CLL or SLL; and MAVYRET to treat patients with chronic HCV genotype 1-6 infection. It also provides CREON, a pancreatic enzyme therapy for exocrine pancreatic insufficiency; Synthroid used in the treatment of hypothyroidism; Linzess/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; Lupron for the palliative treatment of advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; and Botox therapeutic. In addition, the company offers ORILISSA, a nonpeptide small molecule gonadotropin-releasing hormone antagonist for women with moderate to severe endometriosis pain; Duopa and Duodopa, a levodopa-carbidopa intestinal gel to treat Parkinson's disease; Lumigan/Ganfort, a bimatoprost ophthalmic solution for the reduction of elevated intraocular pressure (IOP) in patients with open angle glaucoma (OAG) or ocular hypertension; Ubrelvy to treat migraine with or without aura in adults; Alphagan/ Combigan, an alpha-adrenergic receptor agonist for the reduction of IOP in patients with OAG; and Restasis, a calcineurin inhibitor immunosuppressant to increase tear production, as well as other eye care products. AbbVie Inc. has a research collaboration with Dragonfly Therapeutics, Inc. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.",
    "ceo": "Mr. Richard A. Gonzalez",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "50000",
    "phone": "847 932 7900",
    "address": "1 North Waukegan Road",
    "city": "North Chicago",
    "state": "IL",
    "zip": "60064-6400",
    "dcfDiff": -901.28211,
    "dcf": 1063.3721115720193,
    "image": "https://financialmodelingprep.com/image-stock/ABBV.png",
    "ipoDate": "2013-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "MRK",
    "price": 123.75,
    "beta": 0.384,
    "volAvg": 7983181,
    "mktCap": 313414200000,
    "lastDiv": 3.08,
    "range": "99.14-130.24",
    "changes": 0.92,
    "companyName": "Merck & Co., Inc.",
    "currency": "USD",
    "cik": "0000310158",
    "isin": "US58933Y1055",
    "cusip": "58933Y105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.merck.com",
    "description": "Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes, as well as vaccine products, such as preventive pediatric, adolescent, and adult vaccines. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. It serves drug wholesalers and retailers, hospitals, and government agencies; managed health care providers, such as health maintenance organizations, pharmacy benefit managers, and other institutions; and physicians and physician distributors, veterinarians, and animal producers. The company has collaborations with AstraZeneca PLC; Bayer AG; Eisai Co., Ltd.; Ridgeback Biotherapeutics; and Gilead Sciences, Inc. to jointly develop and commercialize long-acting treatments in HIV. Merck & Co., Inc. was founded in 1891 and is headquartered in Kenilworth, New Jersey.",
    "ceo": "Mr. Robert M. Davis J.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "70000",
    "phone": "908 740 4000",
    "address": "2000 Galloping Hill Road",
    "city": "Kenilworth",
    "state": "NJ",
    "zip": "07033",
    "dcfDiff": -15.76137,
    "dcf": 139.51136807419286,
    "image": "https://financialmodelingprep.com/image-stock/MRK.png",
    "ipoDate": "1978-01-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "T",
    "price": 17.18,
    "beta": 0.694,
    "volAvg": 39614132,
    "mktCap": 122884932200,
    "lastDiv": 1.11,
    "range": "13.43-19.99",
    "changes": 0.01,
    "companyName": "AT&T Inc.",
    "currency": "USD",
    "cik": "0000732717",
    "isin": "US00206R1023",
    "cusip": "00206R102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Telecom Services",
    "website": "https://www.att.com",
    "description": "AT&T Inc. provides telecommunications, media, and technology services worldwide. Its Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, and carrying cases and hands-free devices through its own company-owned stores, agents, and third-party retail stores. It also provides data, voice, security, cloud solutions, outsourcing, and managed and professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband fiber and legacy telephony voice communication services to residential customers. It markets its communications services and products under the AT&T, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The company's Latin America segment provides wireless services in Mexico; and video services in Latin America. This segment markets its services and products under the AT&T and Unefon brand names. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. John T. Stankey",
    "sector": "Communication Services",
    "country": "US",
    "fullTimeEmployees": "149900",
    "phone": "210 821 4105",
    "address": "208 South Akard Street",
    "city": "Dallas",
    "state": "TX",
    "zip": "75202",
    "dcfDiff": -24.34387,
    "dcf": 41.52386731996412,
    "image": "https://financialmodelingprep.com/image-stock/T.png",
    "ipoDate": "1983-11-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "CSCO",
    "price": 49.17,
    "beta": 0.853,
    "volAvg": 19668510,
    "mktCap": 199098672300,
    "lastDiv": 1.6,
    "range": "45.56-58.19",
    "changes": 0.22,
    "companyName": "Cisco Systems, Inc.",
    "currency": "USD",
    "cik": "0000858877",
    "isin": "US17275R1023",
    "cusip": "17275R102",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Communication Equipment",
    "website": "https://www.cisco.com",
    "description": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. It provides infrastructure platforms, including networking technologies of switching, routing, wireless, and data center products that are designed to work together to deliver networking capabilities, and transport and/or store data. The company also offers collaboration products comprising unified communications, Cisco TelePresence, and conferencing, as well as the Internet of Things and analytics software. In addition, it provides security products, such as network security, cloud and email security, identity and access management, advanced threat protection, and unified threat management products. Further, the company offers a range of service and support options for its customers, including technical support and advanced services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.",
    "ceo": "Mr. Charles H. Robbins",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "84900",
    "phone": "408 526 4000",
    "address": "170 West Tasman Drive",
    "city": "San Jose",
    "state": "CA",
    "zip": "95134",
    "dcfDiff": -22.05353,
    "dcf": 71.2235338263108,
    "image": "https://financialmodelingprep.com/image-stock/CSCO.png",
    "ipoDate": "1990-02-16",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "LLY",
    "price": 779.77,
    "beta": 0.344,
    "volAvg": 3291705,
    "mktCap": 740909382280,
    "lastDiv": 5.2,
    "range": "312.31-800.78",
    "changes": 2.18,
    "companyName": "Eli Lilly and Company",
    "currency": "USD",
    "cik": "0000059478",
    "isin": "US5324571083",
    "cusip": "532457108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.lilly.com",
    "description": "Eli Lilly and Company discovers, develops, and markets human pharmaceuticals worldwide. It offers Basaglar, Humalog, Humalog Mix 75/25, Humalog U-100, Humalog U-200, Humalog Mix 50/50, insulin lispro, insulin lispro protamine, insulin lispro mix 75/25, Humulin, Humulin 70/30, Humulin N, Humulin R, and Humulin U-500 for diabetes; and Jardiance, Trajenta, and Trulicity for type 2 diabetes. The company provides Alimta for non-small cell lung cancer (NSCLC) and malignant pleural mesothelioma; Cyramza for metastatic gastric cancer, gastro-esophageal junction adenocarcinoma, metastatic NSCLC, metastatic colorectal cancer, and hepatocellular carcinoma; Erbitux for colorectal cancers, and various head and neck cancers; Retevmo for metastatic NSCLC, medullary thyroid cancer, and thyroid cancer; Tyvyt for relapsed or refractory classic Hodgkin's lymph and non-squamous NSCLC; and Verzenio for HR+, HER2- metastatic breast cancer, node positive, and early breast cancer. It offers Olumiant for rheumatoid arthritis; and Taltz for plaque psoriasis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondylarthritis. The company offers Cymbalta for depressive disorder, diabetic peripheral neuropathic pain, generalized anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; Emgality for migraine prevention and episodic cluster headache; and Zyprexa for schizophrenia, bipolar I disorder, and bipolar maintenance. Its Bamlanivimab and etesevimab, and Bebtelovimab for COVID-19; Cialis for erectile dysfunction and benign prostatic hyperplasia; and Forteo for osteoporosis. The company has collaborations with Incyte Corporation; Boehringer Ingelheim Pharmaceuticals, Inc.; AbCellera Biologics Inc.; Junshi Biosciences; Regor Therapeutics Group; Lycia Therapeutics, Inc.; Kumquat Biosciences Inc.; Entos Pharmaceuticals Inc.; and Foghorn Therapeutics Inc. Eli Lilly and Company was founded in 1876 and is headquartered in Indianapolis, Indiana.",
    "ceo": "Mr. David A. Ricks",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "43000",
    "phone": "317 276 2000",
    "address": "Lilly Corporate Center",
    "city": "Indianapolis",
    "state": "IN",
    "zip": "46285",
    "dcfDiff": 411.54461,
    "dcf": 368.2253886119549,
    "image": "https://financialmodelingprep.com/image-stock/LLY.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "CVX",
    "price": 148.33,
    "beta": 1.118,
    "volAvg": 9226176,
    "mktCap": 275488859100,
    "lastDiv": 6.52,
    "range": "139.62-172.88",
    "changes": -1.26,
    "companyName": "Chevron Corporation",
    "currency": "USD",
    "cik": "0000093410",
    "isin": "US1667641005",
    "cusip": "166764100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://www.chevron.com",
    "description": "Chevron Corporation, through its subsidiaries, engages in integrated energy and chemicals operations worldwide. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification associated with liquefied natural gas; transportation of crude oil through pipelines; and transportation, storage, and marketing of natural gas, as well as operates a gas-to-liquids plant. The Downstream segment engages in refining crude oil into petroleum products; marketing crude oil, refined products, and lubricants; manufacturing and marketing of renewable fuels; transporting crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car; and manufacturing and marketing of commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives. It is also involved in the cash management and debt financing activities; insurance operations; real estate activities; and technology businesses. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is based in San Ramon, California.",
    "ceo": "Mr. Michael K. Wirth",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "45600",
    "phone": "925 842 1000",
    "address": "6001 Bollinger Canyon Road",
    "city": "San Ramon",
    "state": "CA",
    "zip": "94583-2324",
    "dcfDiff": -144.48073,
    "dcf": 292.81073413003605,
    "image": "https://financialmodelingprep.com/image-stock/CVX.png",
    "ipoDate": "1921-06-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "MMM",
    "price": 92.52,
    "beta": 1,
    "volAvg": 4205357,
    "mktCap": 51135804000,
    "lastDiv": 6.04,
    "range": "85.35-113.14",
    "changes": -0.17,
    "companyName": "3M Company",
    "currency": "USD",
    "cik": "0000066740",
    "isin": "US88579Y1010",
    "cusip": "88579Y101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Conglomerates",
    "website": "https://www.3m.com",
    "description": "3M Company operates as a diversified technology company worldwide. It operates through four segments: Safety and Industrial; Transportation and Electronics; Health Care; and Consumer. The Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. The Transportation and Electronics segment provides ceramic solutions; attachment tapes, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; and reflective signage for highway, and vehicle safety. The Healthcare segment offers food safety indicator solutions; health care procedure coding and reimbursement software; skin, wound care, and infection prevention products and solutions; dentistry and orthodontia solutions; and filtration and purification systems. The Consumer segment provides consumer bandages, braces, supports and consumer respirators; cleaning products for the home; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. The company was founded in 1902 and is based in St. Paul, Minnesota.",
    "ceo": "Mr. Michael F. Roman",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "85000",
    "phone": "651 733 1110",
    "address": "3M Center",
    "city": "Saint Paul",
    "state": "MN",
    "zip": "55144-1000",
    "dcfDiff": -45.32709,
    "dcf": 137.8470885136292,
    "image": "https://financialmodelingprep.com/image-stock/MMM.png",
    "ipoDate": "1946-01-14",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "PEP",
    "price": 163,
    "beta": 0.534,
    "volAvg": 5663352,
    "mktCap": 224032090000,
    "lastDiv": 5.06,
    "range": "155.83-196.88",
    "changes": 0.96,
    "companyName": "PepsiCo, Inc.",
    "currency": "USD",
    "cik": "0000077476",
    "isin": "US7134481081",
    "cusip": "713448108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.pepsico.com",
    "description": "PepsiCo, Inc. manufactures, markets, distributes, and sells various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, simply granola, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is headquartered in Purchase, New York.",
    "ceo": "Mr. Ramon Luis Laguarta",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "318000",
    "phone": "914 253 2000",
    "address": "700 Anderson Hill Road",
    "city": "Purchase",
    "state": "NY",
    "zip": "10577",
    "dcfDiff": -39.56566,
    "dcf": 202.56565703762726,
    "image": "https://financialmodelingprep.com/image-stock/PEP.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "CAT",
    "price": 335.63,
    "beta": 1.152,
    "volAvg": 2765254,
    "mktCap": 167605902510,
    "lastDiv": 5.2,
    "range": "204.04-340.26",
    "changes": 2.1,
    "companyName": "Caterpillar Inc.",
    "currency": "USD",
    "cik": "0000018230",
    "isin": "US1491231015",
    "cusip": "149123101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Farm & Heavy Construction Machinery",
    "website": "https://www.caterpillar.com",
    "description": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, and industrial gas turbines worldwide. Its Construction Industries segment offers asphalt pavers, backhoe loaders, compactors, cold planers, compact track and multi-terrain loaders, excavators, motorgraders, pipelayers, road reclaimers, site prep tractors, skid steer loaders, telehandlers, and utility vehicles; mini, small, medium, and large excavators; compact, small, and medium wheel loaders; track-type tractors and loaders; and wheel excavators. The Resource Industries segment provides electric rope shovels, draglines, hydraulic shovels, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway trucks, articulated trucks, wheel tractor scrapers, wheel dozers, fleet management, landfill compactors, soil compactors, machinery components, autonomous ready vehicles and solutions, select work tools, and safety services and mining performance solutions. The Energy & Transportation segment offers reciprocating engines, generator sets, integrated systems and solutions, turbines and turbine-related services, remanufactured reciprocating engines and components, centrifugal gas compressors, diesel-electric locomotives and components, and other rail-related products and services for marine, oil and gas, industrial, and electric power generation sectors. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing plans; and insurance and risk management products for vehicles, power generation facilities, and marine vessels. The All Other operating segment manufactures filters and fluids, undercarriage, ground engaging tools, etc. The company was formerly known as Caterpillar Tractor Co. and changed its name to Caterpillar Inc. in 1986. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
    "ceo": "Mr. D. James Umpleby III",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "113200",
    "phone": "224-551-4000",
    "address": "510 Lake Cook Road",
    "city": "Deerfield",
    "state": "IL",
    "zip": "60015",
    "dcfDiff": 133.08722,
    "dcf": 202.542782223059,
    "image": "https://financialmodelingprep.com/image-stock/CAT.png",
    "ipoDate": "1929-12-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "KO",
    "price": 59.55,
    "beta": 0.591,
    "volAvg": 14513340,
    "mktCap": 256806993000,
    "lastDiv": 1.94,
    "range": "51.55-64.99",
    "changes": 0.03,
    "companyName": "The Coca-Cola Company",
    "currency": "USD",
    "cik": "0000021344",
    "isin": "US1912161007",
    "cusip": "191216100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Beverages—Non-Alcoholic",
    "website": "https://www.coca-colacompany.com",
    "description": "The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks; flavored and enhanced water, and sports drinks; juice, dairy, and plantbased beverages; tea and coffee; and energy drinks. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, Fanta, Fresca, Schweppes, Sprite, Thums Up, Aquarius, Ciel, dogadan, Dasani, glacéau smartwater, glacéau vitaminwater, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, Minute Maid Pulpy, Simply, Ayataka, BODYARMOR, Costa, FUZE TEA, Georgia, and Gold Peak brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.",
    "ceo": "Mr. James Robert B. Quincey",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "79100",
    "phone": "404 676 2121",
    "address": "One Coca-Cola Plaza",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30313",
    "dcfDiff": -53.07409,
    "dcf": 112.62409308112025,
    "image": "https://financialmodelingprep.com/image-stock/KO.png",
    "ipoDate": "1919-09-05",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "IBM",
    "price": 196.16,
    "beta": 0.708,
    "volAvg": 5111354,
    "mktCap": 179828699200,
    "lastDiv": 6.64,
    "range": "120.55-198.13",
    "changes": 4.21,
    "companyName": "International Business Machines Corporation",
    "currency": "USD",
    "cik": "0000051143",
    "isin": "US4592001014",
    "cusip": "459200101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.ibm.com",
    "description": "International Business Machines Corporation provides integrated solutions and services worldwide. The company operates through four business segments: Software, Consulting, Infrastructure, and Financing. The Software segment offers hybrid cloud platform and software solutions, such as Red Hat, an enterprise open-source solutions; software for business automation, AIOps and management, integration, and application servers; data and artificial intelligence solutions; and security software and services for threat, data, and identity. This segment also provides transaction processing software that supports clients' mission-critical and on-premise workloads in banking, airlines, and retail industries. The Consulting segment offers business transformation services, including strategy, business process design and operations, data and analytics, and system integration services; technology consulting services; and application and cloud platform services. The Infrastructure segment provides on-premises and cloud-based server and storage solutions for its clients' mission-critical and regulated workloads; and support services and solutions for hybrid cloud infrastructure, as well as remanufacturing and remarketing services for used equipment. The Financing segment offers lease, installment payment, loan financing, and short-term working capital financing services. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.",
    "ceo": "Mr. Arvind  Krishna",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "282200",
    "phone": "914 499 1900",
    "address": "One New Orchard Road",
    "city": "Armonk",
    "state": "NY",
    "zip": "10504",
    "dcfDiff": -68.57378,
    "dcf": 264.733779842104,
    "image": "https://financialmodelingprep.com/image-stock/IBM.png",
    "ipoDate": "1915-09-24",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "XOM",
    "price": 106.77,
    "beta": 0.947,
    "volAvg": 19690993,
    "mktCap": 423646276800,
    "lastDiv": 3.8,
    "range": "95.77-120.7",
    "changes": 1.13,
    "companyName": "Exxon Mobil Corporation",
    "currency": "USD",
    "cik": "0000034088",
    "isin": "US30231G1022",
    "cusip": "30231G102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Oil & Gas Integrated",
    "website": "https://corporate.exxonmobil.com",
    "description": "Exxon Mobil Corporation explores for and produces crude oil and natural gas in the United States and internationally. It operates through Upstream, Downstream, and Chemical segments. The company is also involved in the manufacture, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; manufactures and sells petrochemicals, including olefins, polyolefins, aromatics, and various other petrochemicals; and captures and stores carbon, hydrogen, and biofuels. As of December 31, 2021, it had approximately 20,528 net operated wells with proved reserves. The company was founded in 1870 and is headquartered in Irving, Texas.",
    "ceo": "Mr. Darren W. Woods",
    "sector": "Energy",
    "country": "US",
    "fullTimeEmployees": "62000",
    "phone": "972-940-6000",
    "address": "5959 Las Colinas Boulevard",
    "city": "Irving",
    "state": "TX",
    "zip": "75039-2298",
    "dcfDiff": -57.09023,
    "dcf": 163.8602346763675,
    "image": "https://financialmodelingprep.com/image-stock/XOM.png",
    "ipoDate": "1978-01-13",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "HON",
    "price": 200.5,
    "beta": 1.023,
    "volAvg": 3118052,
    "mktCap": 130762491000,
    "lastDiv": 4.32,
    "range": "174.88-210.87",
    "changes": 3.15,
    "companyName": "Honeywell International Inc.",
    "currency": "USD",
    "cik": "0000773840",
    "isin": "US4385161066",
    "cusip": "438516106",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Conglomerates",
    "website": "https://www.honeywell.com",
    "description": "Honeywell International Inc. operates as a diversified technology and manufacturing company worldwide. Its Aerospace segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, advanced systems and instruments, satellite and space components, and aircraft wheels and brakes; spare parts; repair, overhaul, and maintenance services; thermal systems, as well as wireless connectivity and management services. The company's Honeywell Building Technologies segment offers software applications for building control and optimization; sensors, switches, control systems, and instruments for energy management; access control; video surveillance; fire products; and installation, maintenance, and upgrades of systems. Its Performance Materials and Technologies segment offers automation control, instrumentation, and software and related services; catalysts and adsorbents, equipment, and consulting; and materials to manufacture end products, such as bullet-resistant armor, nylon, computer chips, and pharmaceutical packaging, as well as provides reduced and low global-warming-potential materials based on hydrofluoro-olefin technology. The company's Safety and Productivity Solutions segment provides personal protection equipment, apparel, gear, and footwear; gas detection technology; cloud-based notification and emergency messaging; mobile devices and software; supply chain and warehouse automation equipment, and software solutions; custom-engineered sensors, switches, and controls; and data and asset management productivity software solutions. The company was founded in 1906 and is headquartered in Charlotte, North Carolina.",
    "ceo": "Mr. Vimal M. Kapur",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "95000",
    "phone": "704 627 6200",
    "address": "855 South Mint Street",
    "city": "Charlotte",
    "state": "NC",
    "zip": "28202",
    "dcfDiff": 69.36935,
    "dcf": 131.13065148573796,
    "image": "https://financialmodelingprep.com/image-stock/HON.png",
    "ipoDate": "2001-02-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AVGO",
    "price": 1350,
    "beta": 1.273,
    "volAvg": 3293583,
    "mktCap": 625618350000,
    "lastDiv": 21,
    "range": "601.29-1438.17",
    "changes": 7.25,
    "companyName": "Broadcom Inc.",
    "currency": "USD",
    "cik": "0001730168",
    "isin": "US11135F1012",
    "cusip": "11135F101",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.broadcom.com",
    "description": "Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing merchant silicon products; embedded processors and controllers; serializer/deserializer application specific integrated circuits; optical and copper, and physical layers; and fiber optic transmitter and receiver components. The company also offers RF front end modules, filters, and power amplifiers; Wi-Fi, Bluetooth, and global positioning system/global navigation satellite system SoCs; custom touch controllers; serial attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express switches; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; and optocouplers, industrial fiber optics, and motion control encoders and subsystems. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was incorporated in 2018 and is headquartered in San Jose, California.",
    "ceo": "Mr. Hock E. Tan",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "20000",
    "phone": "408 433 8000",
    "address": "1320 Ridder Park Drive",
    "city": "San Jose",
    "state": "CA",
    "zip": "95131-2313",
    "dcfDiff": 386.51818,
    "dcf": 963.481819495032,
    "image": "https://financialmodelingprep.com/image-stock/AVGO.png",
    "ipoDate": "2009-08-06",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "NKE",
    "price": 97.63,
    "beta": 1.101,
    "volAvg": 9376354,
    "mktCap": 147931398688,
    "lastDiv": 1.48,
    "range": "88.66-128.68",
    "changes": -0.68,
    "companyName": "NIKE, Inc.",
    "currency": "USD",
    "cik": "0000320187",
    "isin": "US6541061031",
    "cusip": "654106103",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Footwear & Accessories",
    "website": "https://investors.nike.com",
    "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells men's, women's, and kids athletic footwear, apparel, equipment, and accessories worldwide. The company provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; and casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. In addition, it sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. The company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel. Additionally, it licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. The company sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "ceo": "Mr. John J. Donahoe II",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "83700",
    "phone": "503 671 6453",
    "address": "One Bowerman Drive",
    "city": "Beaverton",
    "state": "OR",
    "zip": "97005-6453",
    "dcfDiff": 23.21554,
    "dcf": 74.41446240262785,
    "image": "https://financialmodelingprep.com/image-stock/NKE.png",
    "ipoDate": "1980-12-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "MS",
    "price": 85.66,
    "beta": 1.413,
    "volAvg": 8741227,
    "mktCap": 140077228200,
    "lastDiv": 3.4,
    "range": "69.42-95.95",
    "changes": -3.47,
    "companyName": "Morgan Stanley",
    "currency": "USD",
    "cik": "0000895421",
    "isin": "US6174464486",
    "cusip": "617446448",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.morganstanley.com",
    "description": "Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides sales and trading services, such as sales, financing, prime brokerage, and market-making services in equity and fixed income products consisting of foreign exchange and commodities; corporate and commercial real estate loans, which provides secured lending facilities and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, liquidity, and alternative/other products to benefit/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, and third-party fund sponsors and corporations through institutional and intermediary channels. Morgan Stanley was founded in 1924 and is headquartered in New York, New York.",
    "ceo": "Mr. Edward N. Pick",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "80000",
    "phone": "212 761 4000",
    "address": "1585 Broadway",
    "city": "New York",
    "state": "NY",
    "zip": "10036",
    "dcfDiff": 20.9488,
    "dcf": 64.81620177516889,
    "image": "https://financialmodelingprep.com/image-stock/MS.png",
    "ipoDate": "1993-02-23",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "COST",
    "price": 773.24,
    "beta": 0.765,
    "volAvg": 2247230,
    "mktCap": 343108238720,
    "lastDiv": 4.08,
    "range": "466.8-775.16",
    "changes": 13.29,
    "companyName": "Costco Wholesale Corporation",
    "currency": "USD",
    "cik": "0000909832",
    "isin": "US22160K1051",
    "cusip": "22160K105",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Discount Stores",
    "website": "https://www.costco.com",
    "description": "Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, the United Kingdom, Mexico, Japan, Korea, Australia, Spain, France, Iceland, China, and Taiwan. It offers branded and private-label products in a range of merchandise categories. The company offers sundries, dry groceries, candies, coolers, freezers, liquor, and tobacco and deli products; appliances, electronics, health and beauty aids, hardware, garden and patio products, sporting goods, tires, toys and seasonal products, office supplies, automotive care products, postages, tickets, apparel, small appliances, furniture, domestics, housewares, special order kiosks, and jewelry; and meat, produce, service deli, and bakery products. It also operates pharmacies, opticals, food courts, hearing-aid centers, and tire installation centers, as well as 636 gas stations; and offers business delivery, travel, same-day grocery, and various other services online in various countries. As of August 29, 2021, the company operated 815 membership warehouses, including 564 in the United States and Puerto Rico, 105 in Canada, 39 in Mexico, 30 in Japan, 29 in the United Kingdom, 16 in South Korea, 14 in Taiwan, 12 in Australia, 3 in Spain, 1 in Iceland, 1 in France, and 1 in China. It also operates e-commerce websites in the United States, Canada, the United Kingdom, Mexico, South Korea, Taiwan, Japan, and Australia. The company was formerly known as Costco Companies, Inc. and changed its name to Costco Wholesale Corporation in August 1999. Costco Wholesale Corporation was founded in 1976 and is based in Issaquah, Washington.",
    "ceo": "Mr. Ron M. Vachris",
    "sector": "Consumer Defensive",
    "country": "US",
    "fullTimeEmployees": "316000",
    "phone": "425 313 8100",
    "address": "999 Lake Drive",
    "city": "Issaquah",
    "state": "WA",
    "zip": "98027",
    "dcfDiff": 293.53271,
    "dcf": 479.707294288911,
    "image": "https://financialmodelingprep.com/image-stock/COST.png",
    "ipoDate": "1986-07-09",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "MDT",
    "price": 85.55,
    "beta": 0.771,
    "volAvg": 6166586,
    "mktCap": 113595001000,
    "lastDiv": 2.76,
    "range": "68.84-92.02",
    "changes": 0.95,
    "companyName": "Medtronic plc",
    "currency": "USD",
    "cik": "0001613103",
    "isin": "IE00BTN1Y115",
    "cusip": "585055106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.medtronic.com",
    "description": "Medtronic plc develops, manufactures, and sells device-based medical therapies to healthcare systems, physicians, clinicians, and patients worldwide. Its Cardiovascular Portfolio segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; cardiac ablation products; insertable cardiac monitor systems; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves, surgical valve replacement and repair products, endovascular stent grafts and accessories, and transcatheter pulmonary valves; and percutaneous coronary intervention products, percutaneous angioplasty balloons, and products. The company's Medical Surgical Portfolio segment offers surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, surgical artificial intelligence and robotic-assisted surgery products, hernia mechanical devices, mesh implants, gynecology and lung products, and various therapies to treat diseases, as well as products in the fields of minimally invasive gastrointestinal and hepatologic diagnostics and therapies, patient monitoring, airway management and ventilation therapies, and renal disease. Its Neuroscience Portfolio segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The company's Diabetes Operating Unit segment offers insulin pumps and consumables, continuous glucose monitoring systems, smart insulin pen systems, and consumables and supplies. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
    "ceo": "Mr. Geoffrey Straub Martha",
    "sector": "Healthcare",
    "country": "IE",
    "fullTimeEmployees": "95000",
    "phone": "353 1 438 1700",
    "address": "20 On Hatch",
    "city": "Dublin",
    "state": null,
    "zip": "2",
    "dcfDiff": -20.79133,
    "dcf": 106.34133215313081,
    "image": "https://financialmodelingprep.com/image-stock/MDT.png",
    "ipoDate": "1973-05-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "CVS",
    "price": 74.34,
    "beta": 0.499,
    "volAvg": 11285923,
    "mktCap": 93553173000,
    "lastDiv": 2.66,
    "range": "64.41-83.25",
    "changes": 0.63,
    "companyName": "CVS Health Corporation",
    "currency": "USD",
    "cik": "0000064803",
    "isin": "US1266501006",
    "cusip": "126650100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Healthcare Plans",
    "website": "https://www.cvshealth.com",
    "description": "CVS Health Corporation provides health services in the United States. The company's Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. Its Pharmacy Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, mail order pharmacy, specialty pharmacy and infusion, clinical, and disease and medical spend management services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, plans offered on public health insurance and private health insurance exchanges, other sponsors of health benefit plans, and individuals. This segment operates retail specialty pharmacy stores; and specialty mail-order, mail-order dispensing, and compounding pharmacies, as well as branches for infusion and enteral nutrition services. The company's Retail/LTC segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products; and provides health care services through its MinuteClinic walk-in medical clinics. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to care facilities and other care settings. As of December 31, 2021, it operated approximately 9,900 retail locations and 1,200 MinuteClinic locations, as well as online retail pharmacy websites, LTC pharmacies, and onsite pharmacies. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was founded in 1963 and is headquartered in Woonsocket, Rhode Island.",
    "ceo": "Ms. Karen Sue Lynch",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "219000",
    "phone": "401-765-1500",
    "address": "One CVS Drive",
    "city": "Woonsocket",
    "state": "RI",
    "zip": "02895",
    "dcfDiff": -614.08836,
    "dcf": 691.4082592109049,
    "image": "https://financialmodelingprep.com/image-stock/CVS.png",
    "ipoDate": "1996-11-20",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "BMY",
    "price": 53.38,
    "beta": 0.372,
    "volAvg": 15359777,
    "mktCap": 107944502200,
    "lastDiv": 2.4,
    "range": "47.58-71.07",
    "changes": 1.56,
    "companyName": "Bristol-Myers Squibb Company",
    "currency": "USD",
    "cik": "0000014272",
    "isin": "US1101221083",
    "cusip": "110122108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.bms.com",
    "description": "Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, and markets biopharmaceutical products worldwide. It offers products for hematology, oncology, cardiovascular, immunology, fibrotic, neuroscience, and covid-19 diseases. The company's products include Revlimid, an oral immunomodulatory drug for the treatment of multiple myeloma; Eliquis, an oral inhibitor for reduction in risk of stroke/systemic embolism in NVAF, and for the treatment of DVT/PE; Opdivo for anti-cancer indications; Pomalyst/Imnovid indicated for patients with multiple myeloma; and Orencia for adult patients with active RA and psoriatic arthritis. It also provides Sprycel for the treatment of Philadelphia chromosome-positive chronic myeloid leukemia; Yervoy for the treatment of patients with unresectable or metastatic melanoma; Abraxane, a protein-bound chemotherapy product; Reblozyl for the treatment of anemia in adult patients with beta thalassemia; and Empliciti for the treatment of multiple myeloma. In addition, the company offers Zeposia to treat relapsing forms of multiple sclerosis; Breyanzi, a CD19-directed genetically modified autologous T cell immunotherapy for the treatment of adult patients with relapsed or refractory large B-cell lymphoma; Inrebic, an oral kinase inhibitor indicated for the treatment of adult patients with myelofibrosis; and Onureg for the treatment of adult patients with AML. It sells products to wholesalers, distributors, pharmacies, retailers, hospitals, clinics, and government agencies. The company was formerly known as Bristol-Myers Company. The company was founded in 1887 and is headquartered in New York, New York.",
    "ceo": "Dr. Christopher S. Boerner Ph.D.",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "34100",
    "phone": "212 546 4000",
    "address": "430 East 29th Street",
    "city": "New York",
    "state": "NY",
    "zip": "10016",
    "dcfDiff": -414.45057,
    "dcf": 464.6206747299184,
    "image": "https://financialmodelingprep.com/image-stock/BMY.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "UNP",
    "price": 251,
    "beta": 1.076,
    "volAvg": 2419061,
    "mktCap": 153054278000,
    "lastDiv": 5.2,
    "range": "183.69-258.66",
    "changes": -2.7,
    "companyName": "Union Pacific Corporation",
    "currency": "USD",
    "cik": "0000100885",
    "isin": "US9078181081",
    "cusip": "907818108",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Railroads",
    "website": "https://www.up.com",
    "description": "Union Pacific Corporation, through its subsidiary, Union Pacific Railroad Company, operates in the railroad business in the United States. The company offers transportation services for grain and grain products, fertilizers, food and refrigerated products, and coal and renewables to grain processors, animal feeders, ethanol producers, and other agricultural users; petroleum, and liquid petroleum gases; and construction products, industrial chemicals, plastics, forest products, specialized products, metals and ores, soda ash, and sand, as well as finished automobiles, automotive parts, and merchandise in intermodal containers. As of December 31, 2021, its rail network included 32,452 route miles connecting Pacific Coast and Gulf Coast ports with the Midwest and Eastern United States gateways. The company was founded in 1862 and is headquartered in Omaha, Nebraska.",
    "ceo": "Mr. Vincenzo James Vena",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "32973",
    "phone": "402 544 5000",
    "address": "1400 Douglas Street",
    "city": "Omaha",
    "state": "NE",
    "zip": "68179",
    "dcfDiff": 89.13322,
    "dcf": 161.86677724546945,
    "image": "https://financialmodelingprep.com/image-stock/UNP.png",
    "ipoDate": "1980-01-02",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "LMT",
    "price": 433.48,
    "beta": 0.475,
    "volAvg": 1163542,
    "mktCap": 104747407640,
    "lastDiv": 12.6,
    "range": "393.77-508.1",
    "changes": 1.5,
    "companyName": "Lockheed Martin Corporation",
    "currency": "USD",
    "cik": "0000936468",
    "isin": "US5398301094",
    "cusip": "539830109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.lockheedmartin.com",
    "description": "Lockheed Martin Corporation, a security and aerospace company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services worldwide. It operates through four segments: Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space. The Aeronautics segment offers combat and air mobility aircraft, unmanned air vehicles, and related technologies. The Missiles and Fire Control segment provides air and missile defense systems; tactical missiles and air-to-ground precision strike weapon systems; logistics; fire control systems; mission operations support, readiness, engineering support, and integration services; manned and unmanned ground vehicles; and energy management solutions. The Rotary and Mission Systems segment offers military and commercial helicopters, surface ships, sea and land-based missile defense systems, radar systems, sea and air-based mission and combat systems, command and control mission solutions, cyber solutions, and simulation and training solutions. The Space segment offers satellites; space transportation systems; strategic, advanced strike, and defensive missile systems; and classified systems and services in support of national security systems. This segment also provides network-enabled situational awareness and integrates space and ground-based systems to help its customers gather, analyze, and securely distribute critical intelligence data. It serves primarily serves the U.S. government, as well as foreign military sales contracted through the U.S. government. Lockheed Martin Corporation was founded in 1912 and is headquartered in Bethesda, Maryland.",
    "ceo": "Mr. James D. Taiclet Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "122000",
    "phone": "301 897 6000",
    "address": "6801 Rockledge Drive",
    "city": "Bethesda",
    "state": "MD",
    "zip": "20817",
    "dcfDiff": -202.34303,
    "dcf": 635.8230304898001,
    "image": "https://financialmodelingprep.com/image-stock/LMT.png",
    "ipoDate": "1977-01-03",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "GE",
    "price": 159.5,
    "beta": 1.217,
    "volAvg": 5195783,
    "mktCap": 173588635000,
    "lastDiv": 0.32,
    "range": "86.45-162.15",
    "changes": 1.64,
    "companyName": "General Electric Company",
    "currency": "USD",
    "cik": "0000040545",
    "isin": "US3696043013",
    "cusip": "369604301",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Specialty Industrial Machinery",
    "website": "https://www.ge.com",
    "description": "General Electric Company operates as a high-tech industrial company in Europe, China, Asia, the Americas, the Middle East, and Africa. It operates through four segments: Power, Renewable Energy, Aviation, and Healthcare segments. The Power segment offers gas and steam turbines, full balance of plant, upgrade, and service solutions, as well as data-leveraging software for power generation, industrial, government, and other customers. The Renewables segment provides various solutions for its customers through combining onshore and offshore wind, blade manufacturing, grid solutions, hydro, storage, hybrid renewables, and digital services offerings. The Aviation segment designs and produces commercial and military aircraft engines, integrated engine components, electric power, and mechanical aircraft systems; and provides aftermarket services. The Healthcare segment provides healthcare technologies to developed and emerging markets in medical imaging, digital solutions, patient monitoring and diagnostics, and drug discovery and performance improvement solutions that are the building blocks of precision health to hospitals and medical facilities. The company also engages in the provision of various financial solutions; and management of run-off insurance operations, which provides life and health insurance and reinsurance products, as well as grid management software. General Electric Company was incorporated in 1892 and is headquartered in Boston, Massachusetts.",
    "ceo": "Mr. H. Lawrence Culp Jr.",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "125000",
    "phone": "617 443 3000",
    "address": "5 Necco Street",
    "city": "Boston",
    "state": "MA",
    "zip": "02210",
    "dcfDiff": 138.52919,
    "dcf": 20.970805587193908,
    "image": "https://financialmodelingprep.com/image-stock/GE.png",
    "ipoDate": "1896-05-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "ABT",
    "price": 119.34,
    "beta": 0.743,
    "volAvg": 5148306,
    "mktCap": 207076381200,
    "lastDiv": 2.2,
    "range": "89.67-120.6",
    "changes": 0.86,
    "companyName": "Abbott Laboratories",
    "currency": "USD",
    "cik": "0000001800",
    "isin": "US0028241000",
    "cusip": "002824100",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Medical Devices",
    "website": "https://www.abbott.com",
    "description": "Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The Established Pharmaceutical Products segment provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. The Diagnostic Products segment offers laboratory systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, as well as detect and measure infectious agents; point of care systems; cartridges for testing blood; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for use in laboratories. The Nutritional Products segment provides pediatric and adult nutritional products. The Medical Devices segment offers rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; and diabetes care products, as well as neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.",
    "ceo": "Mr. Robert B. Ford",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "114000",
    "phone": "224 667 6100",
    "address": "100 Abbott Park Road",
    "city": "North Chicago",
    "state": "IL",
    "zip": "60064-6400",
    "dcfDiff": -4.711,
    "dcf": 124.0509968303516,
    "image": "https://financialmodelingprep.com/image-stock/ABT.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AXP",
    "price": 218.45,
    "beta": 1.23,
    "volAvg": 3324225,
    "mktCap": 158129401500,
    "lastDiv": 2.4,
    "range": "140.91-220.38",
    "changes": 1.25,
    "companyName": "American Express Company",
    "currency": "USD",
    "cik": "0000004962",
    "isin": "US0258161092",
    "cusip": "025816109",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Credit Services",
    "website": "https://www.americanexpress.com",
    "description": "American Express Company, together with its subsidiaries, provides charge and credit payment card products, and travel-related services worldwide. The company operates through three segments: Global Consumer Services Group, Global Commercial Services, and Global Merchant and Network Services. Its products and services include payment and financing products; network services; accounts payable expense management products and services; and travel and lifestyle services. The company's products and services also comprise merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, third-party vendors and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.",
    "ceo": "Mr. Stephen Joseph Squeri",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "74600",
    "phone": "212 640 2000",
    "address": "200 Vesey Street",
    "city": "New York",
    "state": "NY",
    "zip": "10285",
    "dcfDiff": -159.86218,
    "dcf": 378.31218366778546,
    "image": "https://financialmodelingprep.com/image-stock/AXP.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "BKNG",
    "price": 3428.03,
    "beta": 1.403,
    "volAvg": 284416,
    "mktCap": 117139213130,
    "lastDiv": 35,
    "range": "2383.18-3918.0",
    "changes": -2.22,
    "companyName": "Booking Holdings Inc.",
    "currency": "USD",
    "cik": "0001075531",
    "isin": "US09857L1089",
    "cusip": "09857L108",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Travel Services",
    "website": "https://www.bookingholdings.com",
    "description": "Booking Holdings Inc. provides travel and restaurant online reservation and related services worldwide. The company operates Booking.com, which offers online accommodation reservations; Rentalcars.com that provides online rental car reservation services; Priceline, which offer online travel reservation services, and consumers hotel, flight, and rental car reservation services, as well as vacation packages, cruises, and hotel distribution services. It also operates Agoda that provides online accommodation reservation services, as well as flight, ground transportation and activities reservation services. In addition, the company operates KAYAK, an online price comparison service that allows consumers to search and compare travel itineraries and prices, comprising airline ticket, accommodation reservation, and rental car reservation information; and OpenTable for booking online restaurant reservations. Further, it offers travel-related insurance products, and restaurant management services to consumers, travel service providers, and restaurants. The company was formerly known as The Priceline Group Inc. and changed its name to Booking Holdings Inc. in February 2018. The company was founded in 1997 and is headquartered in Norwalk, Connecticut.",
    "ceo": "Mr. Glenn D. Fogel",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "23364",
    "phone": "203 299 8000",
    "address": "800 Connecticut Avenue",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06854",
    "dcfDiff": -1562.8522,
    "dcf": 4990.882204091913,
    "image": "https://financialmodelingprep.com/image-stock/BKNG.png",
    "ipoDate": "1999-03-31",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "TXN",
    "price": 171.87,
    "beta": 1.029,
    "volAvg": 5654164,
    "mktCap": 156279328560,
    "lastDiv": 5.2,
    "range": "139.48-188.12",
    "changes": 1.23,
    "companyName": "Texas Instruments Incorporated",
    "currency": "USD",
    "cik": "0000097476",
    "isin": "US8825081040",
    "cusip": "882508104",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Semiconductors",
    "website": "https://www.ti.com",
    "description": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers worldwide. It operates in two segments, Analog and Embedded Processing. The Analog segment offers power products to manage power requirements in various levels using battery-management solutions, DC/DC switching regulators, AC/DC and isolated controllers and converters, power switches, linear regulators, voltage supervisors, voltage references, and lighting products. This segment also provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control for use in end markets, including amplifiers, data converters, interface products, motor drives, clocks, and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. The company also provides DLP products primarily for use in projectors to create high-definition images; calculators; and application-specific integrated circuits. It markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.",
    "ceo": "Mr. Haviv  Ilan",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "34000",
    "phone": "214 479 3773",
    "address": "12500 TI Boulevard",
    "city": "Dallas",
    "state": "TX",
    "zip": "75243",
    "dcfDiff": 39.99506,
    "dcf": 131.87494057956255,
    "image": "https://financialmodelingprep.com/image-stock/TXN.png",
    "ipoDate": "1972-06-01",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "MCD",
    "price": 292.93,
    "beta": 0.718,
    "volAvg": 3067467,
    "mktCap": 211510692360,
    "lastDiv": 6.68,
    "range": "245.73-302.39",
    "changes": 0.39,
    "companyName": "McDonald's Corporation",
    "currency": "USD",
    "cik": "0000063908",
    "isin": "US5801351017",
    "cusip": "580135101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Restaurants",
    "website": "https://corporate.mcdonalds.com",
    "description": "McDonald's Corporation operates and franchises McDonald's restaurants in the United States and internationally. Its restaurants offer hamburgers and cheeseburgers, chicken sandwiches and nuggets, wraps, fries, salads, oatmeal, shakes, desserts, sundaes, soft serve cones, bakery items, soft drinks, coffee, and beverages and other beverages, as well as breakfast menu, including biscuit and bagel sandwiches, breakfast burritos, hotcakes, and other sandwiches. As of December 31, 2021, the company operated 40,031 restaurants. McDonald's Corporation was founded in 1940 and is headquartered in Chicago, Illinois.",
    "ceo": "Mr. Christopher J. Kempczinski",
    "sector": "Consumer Cyclical",
    "country": "US",
    "fullTimeEmployees": "100000",
    "phone": "630 623 3000",
    "address": "110 North Carpenter Street",
    "city": "Chicago",
    "state": "IL",
    "zip": "60607",
    "dcfDiff": -28.50511,
    "dcf": 321.4351107614627,
    "image": "https://financialmodelingprep.com/image-stock/MCD.png",
    "ipoDate": "1965-04-21",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "TMO",
    "price": 591.5,
    "beta": 0.813,
    "volAvg": 1711362,
    "mktCap": 228539038000,
    "lastDiv": 1.4,
    "range": "415.6-598.35",
    "changes": 6.89,
    "companyName": "Thermo Fisher Scientific Inc.",
    "currency": "USD",
    "cik": "0000097745",
    "isin": "US8835561023",
    "cusip": "883556102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.thermofisher.com",
    "description": "Thermo Fisher Scientific Inc. offers life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and service worldwide. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery, and production of drugs and vaccines, as well as diagnosis of infections and diseases to pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for use in laboratory, on production line, and in field for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, and calibration verification fluids; ImmunoCAP for allergy and asthma tests, and EliA for autoimmunity tests; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Services segment provides laboratory refrigerators and freezers, ultralow-temperature freezers, and cryopreservation storage tanks; temperature control, sample preparation and preservation, centrifugation, and biological safety cabinet products; water analysis instruments; laboratory plastics products; laboratory chemicals; and pharma services. The company offers products and services through a direct sales force, customer-service professionals, electronic commerce, third-party distributors, and catalogs. It has a strategic alliance with the University of California, San Francisco. The company was incorporated in 1956 and is based in Waltham, Massachusetts.",
    "ceo": "Mr. Marc N. Casper",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "130000",
    "phone": "781 622 1000",
    "address": "168 Third Avenue",
    "city": "Waltham",
    "state": "MA",
    "zip": "02451",
    "dcfDiff": -259.15484,
    "dcf": 850.6548435708773,
    "image": "https://financialmodelingprep.com/image-stock/TMO.png",
    "ipoDate": "1980-03-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "NEE",
    "price": 55.53,
    "beta": 0.497,
    "volAvg": 11249454,
    "mktCap": 113971437844,
    "lastDiv": 2.06,
    "range": "47.15-79.78",
    "changes": 0.13,
    "companyName": "NextEra Energy, Inc.",
    "currency": "USD",
    "cik": "0000753308",
    "isin": "US65339F1012",
    "cusip": "65339F101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Utilities—Regulated Electric",
    "website": "https://www.nexteraenergy.com",
    "description": "NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear, coal, and natural gas facilities. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. As of December 31, 2021, the company had approximately 28,564 megawatts of net generating capacity; approximately 77,000 circuit miles of transmission and distribution lines; and 696 substations. It serves approximately 11 million people through approximately 5.7 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. The company was founded in 1925 and is headquartered in Juno Beach, Florida.",
    "ceo": "Mr. John W. Ketchum",
    "sector": "Utilities",
    "country": "US",
    "fullTimeEmployees": "16800",
    "phone": "561 694 4000",
    "address": "700 Universe Boulevard",
    "city": "Juno Beach",
    "state": "FL",
    "zip": "33408",
    "dcfDiff": 8.344,
    "dcf": 83.924,
    "image": "https://financialmodelingprep.com/image-stock/NEE.png",
    "ipoDate": "2014-06-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "AMGN",
    "price": 276.59,
    "beta": 0.578,
    "volAvg": 2964386,
    "mktCap": 148229836210,
    "lastDiv": 9,
    "range": "211.71-329.72",
    "changes": -0.06,
    "companyName": "Amgen Inc.",
    "currency": "USD",
    "cik": "0000318154",
    "isin": "US0311621009",
    "cusip": "031162100",
    "exchange": "NASDAQ Global Select",
    "exchangeShortName": "NASDAQ",
    "industry": "Drug Manufacturers—General",
    "website": "https://www.amgen.com",
    "description": "Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. It focuses on inflammation, oncology/hematology, bone health, cardiovascular disease, nephrology, and neuroscience areas. The company's products include Enbrel to treat plaque psoriasis, rheumatoid arthritis, and psoriatic arthritis; Neulasta that reduces the chance of infection due a low white blood cell count in patients cancer; Prolia to treat postmenopausal women with osteoporosis; Xgeva for skeletal-related events prevention; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic arthritis, and oral ulcers associated with Behçet's disease; Aranesp to treat a lower-than-normal number of red blood cells and anemia; KYPROLIS to treat patients with relapsed or refractory multiple myeloma; and Repatha, which reduces the risks of myocardial infarction, stroke, and coronary revascularization. It also markets Nplate, Vectibix, MVASI, Parsabiv, EPOGEN, KANJINTI, BLINCYTO, Aimovig, EVENITY, AMGEVITATM, Sensipar/Mimpara, NEUPOGEN, IMLYGIC, Corlanor, and AVSOLA. Amgen Inc. serves healthcare providers, including physicians or their clinics, dialysis centers, hospitals, and pharmacies. It distributes its products through pharmaceutical wholesale distributors, as well as direct-to-consumer channels. It has collaboration agreements with Novartis Pharma AG; UCB; Bayer HealthCare LLC; BeiGene, Ltd.; Eli Lilly and Company; Datos Health; and Verastem, Inc. to evaluate VS-6766 in combination with lumakrastm (Sotorasib) in patients with KRAS G12C-mutant non-small cell lung cancer. It has an agreement with Kyowa Kirin Co., Ltd. to jointly develop and commercialize KHK4083, a Phase 3-ready anti-OX40 fully human monoclonal antibody for the treatment of atopic dermatitis and other autoimmune diseases; and research and development collaboration with Neumora Therapeutics, Inc. and Plexium, Inc. Amgen Inc. was incorporated in 1980 and is headquartered in Thousand Oaks, California.",
    "ceo": "Mr. Robert A. Bradway",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "26700",
    "phone": "805 447 1000",
    "address": "One Amgen Center Drive",
    "city": "Thousand Oaks",
    "state": "CA",
    "zip": "91320-1799",
    "dcfDiff": -288.28585,
    "dcf": 564.8758537968963,
    "image": "https://financialmodelingprep.com/image-stock/AMGN.png",
    "ipoDate": "1983-06-17",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "RTX",
    "price": 90.26,
    "beta": 0.611,
    "volAvg": 7742925,
    "mktCap": 119759675800,
    "lastDiv": 2.36,
    "range": "68.56-104.91",
    "changes": 0.2,
    "companyName": "Raytheon Technologies Corporation",
    "currency": "USD",
    "cik": "0000101829",
    "isin": "US75513E1010",
    "cusip": "75513E101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Aerospace & Defense",
    "website": "https://www.rtx.com",
    "description": "Raytheon Technologies Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers worldwide. It operates through four segments: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for aircraft manufacturers and airlines, as well as regional, business, and general aviation; and for defense and commercial space operations. This segment also designs, produces, and supports cabin interior, communications and aviation systems, oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; airborne intelligence, surveillance and reconnaissance systems, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and information management services. The Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon Intelligence & Space segment develops and provides integrated space, communication, and sensor systems for missions, training, and cyber and software solutions to intelligence, defense, federal, and commercial customers. The Raytheon Missiles & Defense segment designs, develops, produces, and sustains integrated air and missile defense systems; defensive and combat solutions; land- and sea-based radars; command, control, communications, and intelligence solutions; and naval and undersea sensor solutions for the U.S. and foreign government customers. The company is headquartered in Waltham, Massachusetts.",
    "ceo": "Mr. Gregory J. Hayes",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "185000",
    "phone": "781 522 3000",
    "address": "870 Winter Street",
    "city": "Waltham",
    "state": "MA",
    "zip": "02451",
    "dcfDiff": 52.00158,
    "dcf": 38.2584197220489,
    "image": "https://financialmodelingprep.com/image-stock/RTX.png",
    "ipoDate": "1952-09-15",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "DHR",
    "price": 252.9,
    "beta": 0.86,
    "volAvg": 2799972,
    "mktCap": 187070635800,
    "lastDiv": 1.08,
    "range": "182.09-259.0",
    "changes": -1.49,
    "companyName": "Danaher Corporation",
    "currency": "USD",
    "cik": "0000313616",
    "isin": "US2358511028",
    "cusip": "235851102",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Diagnostics & Research",
    "website": "https://www.danaher.com",
    "description": "Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The company operates through three segments: Life Sciences, Diagnostics, and Environmental & Applied Solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, particle counting and characterization; microscopes; genomics consumables; and Gene and Cell Therapy. This segment also offers bioprocess technologies, consumables, and services; and filtration, separation, and purification technologies to the pharmaceutical and biopharmaceutical, food and beverage, medical, and life sciences companies, as well as universities, medical schools and research institutions, and various industrial manufacturers. The Diagnostics segment provides chemistry, immunoassay, microbiology, and automation systems, as well as hematology, molecular, acute care, and pathology diagnostics products. This segment offers clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The Environmental & Applied Solutions segment offers instrumentation, consumables, software, services, and disinfection systems to analyze, treat, and manage ultra-pure, potable, industrial, waste, ground, source, and ocean water in residential, commercial, industrial, and natural resource applications. This segment also provides instruments, software, services, and consumables for various color and appearance management, packaging design and quality management, packaging converting, printing, marking, coding, and traceability applications for consumer, pharmaceutical, and industrial products. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is headquartered in Washington, the District of Columbia.",
    "ceo": "Mr. Rainer M. Blair",
    "sector": "Healthcare",
    "country": "US",
    "fullTimeEmployees": "61000",
    "phone": "202 828 0850",
    "address": "2200 Pennsylvania Avenue, NW",
    "city": "Washington",
    "state": "DC",
    "zip": "20037-1701",
    "dcfDiff": 7.68654,
    "dcf": 245.21346237559445,
    "image": "https://financialmodelingprep.com/image-stock/DHR.png",
    "ipoDate": "1978-12-29",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "GS",
    "price": 389.57,
    "beta": 1.416,
    "volAvg": 2291422,
    "mktCap": 126829577910,
    "lastDiv": 11,
    "range": "289.36-397.49",
    "changes": -1.34,
    "companyName": "The Goldman Sachs Group, Inc.",
    "currency": "USD",
    "cik": "0000886982",
    "isin": "US38141G1040",
    "cusip": "38141G104",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Capital Markets",
    "website": "https://www.goldmansachs.com",
    "description": "The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through four segments: Investment Banking, Global Markets, Asset Management, and Consumer & Wealth Management. The company's Investment Banking segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and middle-market lending, relationship lending, and acquisition financing, as well as transaction banking services. This segment also offers underwriting services, such as equity underwriting for common and preferred stock and convertible and exchangeable securities; and debt underwriting for various types of debt instruments, including investment-grade and high-yield debt, bank and bridge loans, and emerging-and growth-market debt, as well as originates structured securities. Its Global Markets segment is involved in client execution activities for cash and derivative instruments; credit and interest rate products; and provision of equity intermediation and equity financing, clearing, settlement, and custody services, as well as mortgages, currencies, commodities, and equities related products. The company's Asset Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, as well as invests in corporate, real estate, and infrastructure entities. Its Consumer & Wealth Management segment offers wealth advisory and banking services, including financial planning, investment management, deposit taking, and lending; private banking; and unsecured loans, as well as accepts saving and time deposits. The company was founded in 1869 and is headquartered in New York, New York.",
    "ceo": "Mr. David  Solomon",
    "sector": "Financial Services",
    "country": "US",
    "fullTimeEmployees": "45300",
    "phone": "212-902-1000",
    "address": "200 West Street",
    "city": "New York",
    "state": "NY",
    "zip": "10282",
    "dcfDiff": -379.74312,
    "dcf": 762.5531182063185,
    "image": "https://financialmodelingprep.com/image-stock/GS.png",
    "ipoDate": "1999-05-04",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "ORCL",
    "price": 112.27,
    "beta": 0.994,
    "volAvg": 9818379,
    "mktCap": 308621248400,
    "lastDiv": 1.6,
    "range": "82.04-127.54",
    "changes": 1.33,
    "companyName": "Oracle Corporation",
    "currency": "USD",
    "cik": "0001341439",
    "isin": "US68389X1054",
    "cusip": "68389X105",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Software—Infrastructure",
    "website": "https://www.oracle.com",
    "description": "Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Advertising, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database, an enterprise database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database, MySQL HeatWave, Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.",
    "ceo": "Ms. Safra Ada Catz",
    "sector": "Technology",
    "country": "US",
    "fullTimeEmployees": "164000",
    "phone": "737 867 1000",
    "address": "2300 Oracle Way",
    "city": "Austin",
    "state": "TX",
    "zip": "78741",
    "dcfDiff": -0.09135811,
    "dcf": 112.36135811486008,
    "image": "https://financialmodelingprep.com/image-stock/ORCL.png",
    "ipoDate": "1986-03-12",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "UPS",
    "price": 152.55,
    "beta": 1.049,
    "volAvg": 4054550,
    "mktCap": 130072232846,
    "lastDiv": 6.52,
    "range": "133.68-197.8",
    "changes": 2.89,
    "companyName": "United Parcel Service, Inc.",
    "currency": "USD",
    "cik": "0001090727",
    "isin": "US9113121068",
    "cusip": "911312106",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Integrated Freight & Logistics",
    "website": "https://www.ups.com",
    "description": "United Parcel Service, Inc. provides letter and package delivery, transportation, logistics, and related services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services in Europe, the Asia Pacific, Canada and Latin America, the Indian sub-continent, the Middle East, and Africa. This segment offers guaranteed time-definite express options. The company also provides international air and ocean freight forwarding, customs brokerage, distribution and post-sales, and mail and consulting services in approximately 200 countries and territories. In addition, it offers truckload brokerage services; supply chain solutions to the healthcare and life sciences industry; shipping, visibility, and billing technologies; and financial and insurance services. The company operates a fleet of approximately 121,000 package cars, vans, tractors, and motorcycles; and owns 59,000 containers that are used to transport cargo in its aircraft. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.",
    "ceo": "Ms. Carol B. Tome",
    "sector": "Industrials",
    "country": "US",
    "fullTimeEmployees": "265100",
    "phone": "404 828 6000",
    "address": "55 Glenlake Parkway, N.E.",
    "city": "Atlanta",
    "state": "GA",
    "zip": "30328",
    "dcfDiff": 10.13188,
    "dcf": 142.4181160851084,
    "image": "https://financialmodelingprep.com/image-stock/UPS.png",
    "ipoDate": "1999-11-10",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  },
  {
    "symbol": "ACN",
    "price": 380.83,
    "beta": 1.195,
    "volAvg": 2060447,
    "mktCap": 238777363360,
    "lastDiv": 5.16,
    "range": "242.8-386.98",
    "changes": 3.95,
    "companyName": "Accenture plc",
    "currency": "USD",
    "cik": "0001467373",
    "isin": "IE00B4BNMY34",
    "cusip": "G1151C101",
    "exchange": "New York Stock Exchange",
    "exchangeShortName": "NYSE",
    "industry": "Information Technology Services",
    "website": "https://www.accenture.com",
    "description": "Accenture plc, a professional services company, provides strategy and consulting, interactive, and technology and operations services worldwide. The company offers application services, including agile transformation, DevOps, application modernization, enterprise architecture, software and quality engineering, data management, intelligent automation comprises robotic process automation, natural language processing, and virtual agents, and liquid application management services, as well as program, project, and service management services; strategy consulting services; critical data elements, data management and governance, data platform and architecture, product-based organization and skills, business adoption, and value realization services; engineering, and research and development digitization; smart connected product design and development; product platform engineering and modernization; product as-a-service enablement; products related to production and operations; autonomous robotics systems; the digital transformation of capital projects; and digital industrial workforce solutions. It also provides data-enabled operating models; technology consulting and artificial intelligence services; services related to talent and organization/human potential; digital commerce; infrastructure services, such as hybrid cloud, network, digital workplace and collaboration, service and experience management, infrastructure as code, and managed edge and IoT devices; cyber defense, applied cybersecurity, managed security, OT security, security strategy and risk, and industry security products; services related to technology innovation; and intelligent automation services. In addition, the company offers cloud, ecosystem, marketing, supply chain management, zero-based budgeting, customer experience, finance consulting, mergers and acquisitions, and sustainability services. Accenture plc was founded in 1951 and is based in Dublin, Ireland.",
    "ceo": "Ms. Julie T. Spellman Sweet",
    "sector": "Technology",
    "country": "IE",
    "fullTimeEmployees": "743000",
    "phone": "353 1 646 2000",
    "address": "1 Grand Canal Square",
    "city": "Dublin",
    "state": null,
    "zip": "2",
    "dcfDiff": 46.87182,
    "dcf": 333.9581758844869,
    "image": "https://financialmodelingprep.com/image-stock/ACN.png",
    "ipoDate": "2001-07-19",
    "defaultImage": false,
    "isEtf": false,
    "isActivelyTrading": true,
    "isAdr": false,
    "isFund": false
  }
]
